//=============================================================================
//その他オブジェクト処理[CObject.h]
//Author:HUMITO KIMURA
//=============================================================================

#ifndef _COBJECT_H_
#define _COBJECT_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "CSceneX.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CMeshOrbit;//軌跡エフェクト

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CObject : public CSceneX
{
	//外部
	public:
		CObject();		//コンストラクタ
		~CObject();		//デストラクタ

		//初期化
		HRESULT Init(char *FileName,D3DXVECTOR3 pos,D3DXVECTOR3 rot);
		void Uninit();	//終了
		void Update();	//更新
		void Draw();	//描画

		//インスタンス生成
		static void Create(char *FileName,D3DXVECTOR3 pos,D3DXVECTOR3 rot);

	//内部
	private:
		//軌跡エフェクト
		CMeshOrbit *m_pMeshOrbit;
};

#endif
//EOF