//=============================================================================
// コンボ表示 [Combo.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _COMBO_H_
#define _COMBO_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"
#include "Number.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
//コンボクラス
class CCombo : public CScene2D
{
	//外部
	public:
		CCombo(){}				//コンストラクタ
		~CCombo(){}				//デストラクタ
		HRESULT Init();			//初期化
		void Uninit();			//終了
		void Update();			//更新
		void Draw();			//描画
		static void Create();	//インスタンス生成
		static void AddCombo();	//コンボ加算

	//内部
	private:
		CNumber m_Number;		//数字インスタンス
		int m_nCount;			//表示カウント
		static int m_nCombo;	//コンボ
		static bool m_bDisp;	//表示フラグ
};
#endif
//EOF