//=============================================================================
// 敵消滅エリア [EraseArea.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _ERASEAREA_H_
#define _ERASEAREA_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "Scene3D.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
//消滅エリアクラス
class CEraseArea : CScene3D
{
	//外部
	public:
		CEraseArea(){}					//コンストラクタ
		~CEraseArea(){}					//デストラクタ
		HRESULT Init();					//初期化
		void Uninit();					//終了
		void Draw();					//描画
		void SetColor(D3DCOLOR color);	//色の設定
		static CEraseArea *Create();	//インスタンス生成
	//内部
	private:
};
#endif
//EOF