//=============================================================================
// 情報表示 [InforMation.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _INFORMATION_H_
#define _INFORMATION_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "SceneBillboard.h"

//*****************************************************************************
//列挙型定義
//*****************************************************************************
//情報の種類
enum INFO_TYPE
{
	TIME_UP = 0,	//タイムアップ
	CLOCK_UP,		//クロックアップ
	INFO_NUM		//情報の種類数
};
//*****************************************************************************
//クラス定義
//*****************************************************************************
//情報表示クラス
class CInfo : public CSceneBillboard
{
	//外部
	public:
		CInfo(){}							//コンストラクタ
		~CInfo(){}							//デストラクタ
		HRESULT Init(INFO_TYPE type);		//初期化
		void Uninit();						//終了
		void Update();						//更新
		void Draw();						//描画
		static void Create(INFO_TYPE type);	//インスタンス生成
	//内部
	private:
		int m_nCount;						//表示カウント
};
#endif
//EOF