//=============================================================================
// アイテム処理 [Item.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "SceneBillboard.h"

//*****************************************************************************
//定数定義
//*****************************************************************************
#define ITEM_RADIUS (25)//アイテムの半径

//*****************************************************************************
//列挙型定義
//*****************************************************************************
//アイテムの種類
enum ITEM_TYPE
{
	ITEM_TIME_UP = 0,	//タイムアップ
	ITEM_CLOCK_UP,		//クロックアップ
	//TODOアイテム追加
	ITEM_TYPE_NUM		//アイテム数
};

//*****************************************************************************
//クラス定義
//*****************************************************************************
//アイテムクラス
class CItem : public CSceneBillboard
{
	//外部
	public:
		CItem();										//コンストラクタ
		~CItem(){}										//デストラクタ
		HRESULT Init(D3DXVECTOR3 pos,					//初期化
					ITEM_TYPE type);
		void Uninit();									//終了
		void Update();									//更新
		void Draw();									//描画
		ITEM_TYPE GetItemType(){ return m_itemType; }
		static void Create(D3DXVECTOR3 pos,				//インスタンス生成
							ITEM_TYPE type);
	//内部
	private:
		D3DXVECTOR3 m_velocity;							//速度
		ITEM_TYPE m_itemType;							//アイテムの種類
};

#endif
//EOF