//=============================================================================
//
// ライト処理 [Light.h]
// Author : HUMITO KIMURA
//
//=============================================================================
#ifndef _CLIGHT_H_
#define _CLIGHT_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "d3dx9.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
//ライトクラス
class CLight
{
	//外部
	public:
		CLight();							//コンストラクタ
		~CLight();							//デストラクタ
		HRESULT Init(D3DXVECTOR3 pos,		//初期化
					D3DLIGHTTYPE type,
					DWORD index);
		void Update();						//更新
		void Set();							//ライトセット
		D3DXVECTOR3 GetVecDir();			//ライトのベクトル取得

	//内部
	private:
		D3DLIGHT9			m_light;		//ライト情報
		D3DXVECTOR3			m_vecDir;		//ライトベクトル
		DWORD				m_lightIndex;	//有効ライトの番号
};
#endif
//EOF