//=============================================================================
// メニュー管理処理 [Menu.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _MENU_H_
#define _MENU_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <windows.h>
#include "renderer.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CImage;//画像

//*****************************************************************************
//列挙型定義
//*****************************************************************************
//ゲームメニューラベル
enum GAME_MENU
{
	TUTORIAL = 0,	//チュートリアル
	STAGE1,			//ステージ１
	STAGE2,			//ステージ２
	STAGE3,			//ステージ３
	RANKING,		//ランキング
	BUTTON_NUM		//ボタン数
};

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CMenu
{
	//外部
	public:
		CMenu();						//コンストラクタ
		~CMenu(){}						//デストラクタ
		HRESULT Init();					//初期化
		void Uninit();					//終了
		void Update();					//更新

	//内部
	private:
		//メニュー選択してる状態
		enum MENU_STATUS
		{
			MAIN_SELECT = 0,			//メインセレクト
			TUTORIAL_MODE,				//チュートリアル時
			STAGE_RANK_SELECT,			//各ステージのランキングセレクト時
			STATUS_NUM					//セレクト数
		};

		CImage *m_pButton[BUTTON_NUM];	//各ボタンオブジェクト
		CImage *m_pMessage;				//メッセージオブジェクト
		CImage *m_pTutorial;			//チュートリアルオブジェクト

		int m_nSelectIndex;				//選択メニュー番号
		int m_nPrevSelectIndex;			//前の選択メニュー番号
		int m_nSelectMin;				//選択番号最小値
		int m_nSelectMax;				//選択番号最大値
		int m_nTutorialIndex;			//チュートリアルの番号

		float m_fTime;					//アニメーションのタイム

		D3DXVECTOR3 m_scl;				//現在のスケール
		D3DXVECTOR3 m_destScl;			//目的のスケール

		MENU_STATUS m_status;			//メニュー状態

		void MenuInput();				//メニュー操作

		void ButtonAnim();				//ボタンアニメーション
};
#endif
//EOF