//=============================================================================
// ポーズ画面処理 [Pause.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"

//*****************************************************************************
//構造体
//*****************************************************************************
//ポーズメニュー
enum PAUSE_MENU
{
	PAUSE_CLOSE = 0,	//ポーズ画面を閉じる
	PAUSE_RESET,	//ゲームをリセット
	PAUSE_TITLE,	//タイトル画面へ
	PAUSE_MAX		//メニュー数
};

//*****************************************************************************
//クラス定義
//*****************************************************************************
//ポーズクラス
class CPause : public CScene2D
{
	//外部
	public:
		CPause();									//コンストラクタ
		~CPause();									//デストラクタ
		HRESULT Init();								//初期化
		void Uninit();								//終了
		void Update();								//更新
		void Draw();								//描画
		static CPause *Create();					//インスタンス生成
	//内部
	private:
		void ChangeBuffer();						//頂点情報の変更
		PAUSE_MENU m_selectMenu;					//選択した項目
		float m_fAddPos;							//Y座標移動量
		float m_fMiddleX, m_fMiddleY;				//スクリーンの中間座標
		LPDIRECT3DTEXTURE9 m_pD3DCursolTex;			//カーソルテクスチャへのポインタ
		LPDIRECT3DVERTEXBUFFER9 m_pD3DCursolVtxBuff;//カーソル頂点バッファへのポインタ
};

#endif
//EOF