//=============================================================================
// リザルト管理処理 [Result.h]
// Author : HUMITO KIMURA
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <windows.h>

//*****************************************************************************
//定数定義
//*****************************************************************************
#define PREV_GAME (0)//前ステートゲーム
#define PREV_MENU (1)//前ステートメニュー

//*****************************************************************************
//クラス定義
//*****************************************************************************
//タイトルクラス
class CResult
{
	//外部
	public:
		CResult(){}			//コンストラクタ
		~CResult(){}		//デストラクタ
		HRESULT Init();		//初期化
		void Uninit();		//終了
		void Update();		//更新

		//前ステートのセット
		static void SetPrevState(int nPrev)
		{ m_nPrevState = nPrev; }

	//内部
	private:
		static bool m_bRankOpen;	//ランキング表示フラグ
		static int m_nPrevState;	//前のステート
};
#endif
//EOF