//=============================================================================
// 影描画処理 [Shadow.h]
// Author : HUMITO KIMURA
//=============================================================================

#ifndef _SHADOW_H_
#define _SHADOW_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "SceneX.h"
#include <Windows.h>

//*****************************************************************************
//クラス定義
//*****************************************************************************
//影クラス
class CShadow : public CSceneX
{
	//外部
	public:
		CShadow(int priority = 5);	//コンストラクタ
		~CShadow(){};				//デストラクタ
		HRESULT Init();				//初期化
		void Uninit();				//終了
		void Update();				//更新
		void Draw();				//描画
		static CShadow *Create();	//インスタンス生成

	//内部
	private:
		VERTEX_2D m_aVtx[4];		//ステンシル用ポリゴン
};
#endif
//EOF