//=============================================================================
// ゲーム管理処理 [Title.h]
// Author : 木村 文登
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "State.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CMeshField;		//フィールド
class CPlayer;			//プレイヤー

//*****************************************************************************
//クラス定義
//*****************************************************************************
//タイトル管理クラス
class CGame : public CState
{
	//外部
	public:
		CGame(){}		//コンストラクタ
		~CGame(){}		//デストラクタ
		void Init();	//初期化
		void Uninit();	//終了
		void Update();	//更新

		//フィールド取得
		static CMeshField *GetField()
		{ return m_pField; }

		//プレイヤー取得
		static CPlayer *GetPlayer()
		{ return m_pPlayer; }

		//所持アイテム数取得
		static int GetItemNum()
		{ return m_nNumItem; }

		//所持アイテム数加算
		static void AddItemNum();

		//インスタンス生成
		static CGame *CGame::Create();

	//内部
	private:

		static int m_nNumItem;			//取得したアイテムの個数
		static CMeshField *m_pField;	//フィールドインスタンス
		static CPlayer *m_pPlayer;		//プレイヤーインスタンス

		//一定量のアイテム生成
		static void AppItems();
};
#endif
//EOF