//=============================================================================
// タイトル管理処理 [Result.cpp]
// Author : 木村 文登
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "Result.h"
#include "../main.h"
#include "../manager.h"
#include "../Scene/scene.h"
#include "../System/Input/InputKeyboard.h"
#include "../Shader/Fade.h"
#include "../System/renderer.h"
#include "../Object/BackGround.h"
#include "../Object/Score.h"

//*****************************************************************************
//定数定義
//*****************************************************************************
#define ITEM_NUM_MAX (99)									//所持アイテム最大値

//=============================================================================
//初期化
//=============================================================================
void CResult::Init()
{
	//リザルト用背景生成
	CBackGround::Create("data/TEXTURE/result.jpg");

	//所持数生成して数値をセット
	D3DXVECTOR3 numPos = D3DXVECTOR3((SCREEN_WIDTH / 2) - (100.0f / 2) + 100.0f,
									SCREEN_HEIGHT - 200.0f,
									0.0f);

	CScore::Create(numPos, 300.0f, 200.0f,
					1, DISP_2DPOLYGON, 2);

}
//=============================================================================
//終了
//=============================================================================
void CResult::Uninit()
{
	//全オブジェクト削除
	CScene::ReleaseAll();
}
//=============================================================================
//更新
//=============================================================================
void CResult::Update()
{
	//全オブジェクト更新
	CScene::UpdateAll();

	//エンターでタイトルへフェード
	if (CInputKeyboard::GetKeyTrigger(DIK_RETURN))
		CManager::GetRenderer()->GetFade()->StartFade(TITLE_STATE);
}
//=============================================================================
//インスタンス生成
//=============================================================================
CResult *CResult::Create()
{
	CResult *pInstance = new CResult();
	pInstance->Init();
	return pInstance;
}
//EOF