//=============================================================================
// タイトル管理処理 [Title.cpp]
// Author : 木村 文登
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "Title.h"
#include "../manager.h"
#include "../Scene/scene.h"
#include "../System/Input/InputKeyboard.h"
#include "../Shader/Fade.h"
#include "../System/renderer.h"
#include "../Object/BackGround.h"

//=============================================================================
//初期化
//=============================================================================
void CTitle::Init()
{
	//タイトル用背景生成
	CBackGround::Create("data/TEXTURE/title.jpg");
}
//=============================================================================
//終了
//=============================================================================
void CTitle::Uninit()
{
	//全オブジェクト削除
	CScene::ReleaseAll();
}
//=============================================================================
//更新
//=============================================================================
void CTitle::Update()
{
	//全オブジェクト更新
	CScene::UpdateAll();

	//エンターでゲームへフェード
	if (CInputKeyboard::GetKeyTrigger(DIK_RETURN))
		CManager::GetRenderer()->GetFade()->StartFade(GAME_STATE);
}
//=============================================================================
//インスタンス生成
//=============================================================================
CTitle *CTitle::Create()
{
	CTitle *pInstance = new CTitle();
	pInstance->Init();
	return pInstance;
}
//EOF