//=============================================================================
//デバッグ表示処理[CDebugproc.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _CDEBUGPROC_H_
#define _CDEBUGPROC_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "renderer.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//デバッグクラス
class CDebug
{
	//外部
	public:
		CDebug();							//コンストラクタ
		~CDebug();							//デストラクタ
		HRESULT Init();						//初期化
		void Uninit();						//終了
		static void Draw();					//描画
		static void Print(char *fmt,...);	//文字入力

	//内部
	private:
		static LPD3DXFONT m_pD3DXFont2;		//フォントバッファ
		static char m_aStrDebug[1024];		//文字列
};

#endif
//EOF