//=============================================================================
//エフェクト処理[CEffect.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _CEFFECT_H_
#define _CEFFECT_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "CSceneBillboard.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//エフェクトクラス
class CEffect : public CSceneBillboard
{
	//外部
	public:
		CEffect();							//コンストラクタ
		~CEffect();							//デストラクタ
		HRESULT Init(D3DXVECTOR3 pos);		//初期化
		void Uninit();						//終了
		void Update();						//更新
		void Draw();						//描画
		static void Create(D3DXVECTOR3 pos);//インスタンス生成

	//内部
	private:
		void ChangeTexture();				//テクスチャ座標変更
		float m_fCount;						//カウント
};

#endif
//EOF