//=============================================================================
//
// 入力処理 [CInput.h]
// Author : 木村　文登
//
//=============================================================================
#ifndef _CINPUT_H_
#define _CINPUT_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#define DIRECTINPUT_VERSION (0x0800)    // 警告対策用
#include "dinput.h"
#include "d3dx9.h"
#include <Windows.h>
//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************
#pragma comment (lib, "dinput8.lib")
#pragma comment (lib, "winmm.lib")
//*****************************************************************************
//クラス定義
//*****************************************************************************
//入力処理クラス
class CInput
{
	//外部
	public:
		CInput();										//コンストラクタ
		~CInput();										//デストラクタ
		HRESULT Init(HINSTANCE hInstance, HWND hWnd);	//初期化
		virtual void Uninit();							//終了
		virtual void Update()=0;						//更新
	//派生クラスのみ外部
	protected:
		HRESULT hr;										//処理結果
		LPDIRECTINPUT8 m_pDInput;						//入力用デバイス
};
#endif
//EOF