//=============================================================================
//ライフ処理[CLife.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _CLIFE_H_
#define _CLIFE_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//ライフクラス
class CLife : public CScene2D
{
	//外部
	public:
		CLife();
		~CLife();
		HRESULT Init();
		void Uninit();
		void Update();
		void Draw();
		static void Create();

		static void DestLife();//ライフ減算
		static bool LostLife();//ライフがない状態かチェックする関数

	//内部
	private:
		static int m_nLife;//ライフ数

		//頂点情報変更
		void ChangeBuffer(int num);
};
#endif
//EOF