//=============================================================================
//
// ライト処理 [CLight.h]
// Author : HUMITO KIMURA
//
//=============================================================================
#ifndef _CLIGHT_H_
#define _CLIGHT_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "d3dx9.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//ライトクラス
class CLight
{
	//外部
	public:
		CLight();					//コンストラクタ
		~CLight();					//デストラクタ
		HRESULT Init();				//初期化
		void Update();				//更新
		void Set();					//ライトセット
		D3DXVECTOR3 GetVecDir();	//ライトベクトルのゲット

	//内部
	private:
	D3DLIGHT9			m_aLight[3];//ライト情報
	D3DXVECTOR3			m_vecDir;	//ライトベクトル
};

#endif
//EOF