//=============================================================================
// リザルト背景処理 [CResultBg.h]
// Author : 木村　文登
//=============================================================================
#ifndef _CRESULTBG_H_
#define _CRESULTBG_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//リザルトロゴクラス
class CResultBg : public CScene2D
{
	//外部
	public:
		CResultBg();			//コンストラクタ
		~CResultBg();			//デストラクタ
		HRESULT Init();			//初期化
		void Uninit();			//終了
		void Update();			//更新
		void Draw();			//描画
		static void Create();	//インスタンス生成
};
#endif
//EOF