//=============================================================================
// リザルトロゴ処理 [CResultLogo.h]
// Author : 木村　文登
//=============================================================================
#ifndef _CRESULTLOGO_H_
#define _CRESULTLOGO_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//リザルトロゴクラス
class CResultLogo : public CScene2D
{
	//外部
	public:
		CResultLogo();			//コンストラクタ
		~CResultLogo();			//デストラクタ
		HRESULT Init();			//初期化
		void Uninit();			//終了
		void Update();			//更新
		void Draw();			//描画
		static void Create();	//インスタンス生成
};
#endif
//EOF