//=============================================================================
// スタートロゴ処理 [CStartLogo.h]
// Author : 木村　文登
//=============================================================================
#ifndef _CSTARTLOGO_H_
#define _CSTARTLOGO_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//スタートロゴクラス
class CStartLogo : public CScene2D
{
	//外部
	public:
		CStartLogo();			//コンストラクタ
		~CStartLogo();			//デストラクタ
		HRESULT Init();			//初期化
		void Uninit();			//終了
		void Update();			//更新
		void Draw();			//描画
		static void Create();	//インスタンス生成
};
#endif
//EOF