//=============================================================================
// タイトル処理 [CTitle.h]
// Author : 木村　文登
//=============================================================================
#ifndef _CTITLE_H_
#define _CTITLE_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <windows.h>
#include "renderer.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
//タイトルクラス
class CTitle
{
	//外部
	public:
		CTitle();						//コンストラクタ
		~CTitle();						//デストラクタ
		HRESULT Init();					//初期化
		void Uninit();					//終了
		void Update();					//更新
		void Draw();					//描画
	//内部
	private:
		int m_nCnt;						//経過カウント
		bool m_bTutorial;				//チュートリアル背景フラグ
};
#endif
//EOF