//=============================================================================
// タイトルロゴ処理 [CTitleLogo.h]
// Author : 木村　文登
//=============================================================================
#ifndef _CTITLELOGO_H_
#define _CTITLELOGO_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"
//*****************************************************************************
//クラス定義
//*****************************************************************************
//タイトルロゴクラス
class CTitleLogo : public CScene2D
{
	//外部
	public:
		CTitleLogo();			//コンストラクタ
		~CTitleLogo();			//デストラクタ
		HRESULT Init();			//初期化
		void Uninit();			//終了
		void Update();			//更新
		void Draw();			//描画
		static void Create();	//インスタンス生成
};
#endif
//EOF