//=============================================================================
//トゥーンシェーダー処理[CToonShader.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _CTOONSHADER_H_
#define _CTOONSHADER_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "renderer.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
//トゥーンシェーダークラス
class CToonShader
{
	//外部
	public:
		CToonShader();		//コンストラクタ
		~CToonShader();		//デストラクタ
		HRESULT Init();		//初期化
		void Uninit();		//終了
		static void Begin();//シェーダー開始
		static void End();	//シェーダー終了
	//内部
	private:
		static LPDIRECT3DTEXTURE9 m_pD3DTexture;//テクスチャファイル
		static bool m_bToon;					//・・・
};
#endif
//EOF