//=============================================================================
//チュートリアル背景処理[CTutorial.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _CTUTORIALBG_H_
#define _CTUTORIALBG_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include <Windows.h>
#include "scene2D.h"

//*****************************************************************************
//クラス定義
//*****************************************************************************
//チュートリアル背景クラス
class CTutorialBG : public CScene2D
{
	//外部
	public:
		CTutorialBG();			//コンストラクタ
		~CTutorialBG();			//デストラクタ
		HRESULT Init();			//初期化
		void Uninit();			//終了
		void Update();			//更新
		void Draw();			//描画
		static void Create();	//インスタンス生成

	//内部
	private:
		int m_nPage;			//チュートリアルの項目
};
#endif
//EOF