//=============================================================================
//所持数表示処理[CItemPossession.cpp]
//Author:HUMITO KIMURA
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "CItemPossession.h"
#include <math.h>

//*****************************************************************************
//定数定義
//*****************************************************************************
#define CUT (10)//桁ずらし用
#define POSSE_WIDTH (50.0f)
#define POSSE_HEIGHT (60.0f)
//*****************************************************************************
//スタティックメンバ変数宣言
//*****************************************************************************
int CPossessionNum::m_nNumItems=0;

//=============================================================================
//コンストラクタ
//=============================================================================
CPossessionNum::CPossessionNum()
{
}
//=============================================================================
//デストラクタ
//=============================================================================
CPossessionNum::~CPossessionNum()
{
}
//=============================================================================
//初期化
//=============================================================================
HRESULT CPossessionNum::Init(D3DXVECTOR3 pos,NUMBER_DISP type)
{
	//座標保存
	m_pos=pos;

	//表示方法保存
	m_dispType=type;

	//桁数
	m_nDigitNum=1;

	//数値の範囲を設定
	m_nUpperLimit=1;
	for(int i=0;i<m_nDigitNum;i++)
	{
		//上限
		m_nUpperLimit*=CUT;
	}

	//下限
	m_nLowerLimit=m_nUpperLimit/CUT;

	//数値初期化
	m_Number.Init("data/TEXTURE/number000.png",pos,type,
					POSSE_WIDTH,POSSE_HEIGHT,m_nDigitNum);

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CPossessionNum::Uninit()
{
	//数値終了
	m_Number.Uninit();

	//自身を削除
	this->Release();
}
//=============================================================================
//更新
//=============================================================================
void CPossessionNum::Update()
{
	///////////////////////////
	//		桁数を測る		//
	/////////////////////////
	/*	所持数が上限か下限を超えている場合のみ桁数と範囲を変更する
		例: 所持数:160 桁数:3 上限:1000 下限:100の場合
		100<160<=1000となる。この所持数が上限を超えたら(所持数:1000)
		桁数は4 所持数の範囲は1000<1000<=10000に変更される
	*/
	if(	m_nNumItems>=m_nUpperLimit ||
		m_nNumItems<m_nLowerLimit &&
		m_nLowerLimit!=1)
	{
		//測定用桁数
		int nDigitNum=1;
		//アイテム数を別で用意
		int nNumItems=m_nNumItems;

		//桁数カウントループ
		while(nNumItems/CUT!=0)
		{
			//桁数アップ
			nDigitNum++;

			//桁をずらす
			nNumItems/=CUT;
		}

		//桁数更新
		m_nDigitNum=nDigitNum;

		//変更した桁数から数値の範囲を設定
		m_nUpperLimit=1;
		for(int i=0;i<m_nDigitNum;i++)
		{
			//上限
			m_nUpperLimit*=CUT;
		}

		//下限
		m_nLowerLimit=m_nUpperLimit/CUT;

		//桁数を変更した数値インスタンスに生成しなおす
		//現在の数値インスタンスを終了
		m_Number.Uninit();

		//座標調節
		m_pos.x=m_pos.x-POSSE_WIDTH*(m_nDigitNum-1);
		
		//数値のX座標を画面外に行かないようにする
		if(m_pos.x<0)
		{
			m_pos.x=0.0f;
		}
		
		//新しく初期化する
		m_Number.Init("data/TEXTURE/number000.png",m_pos,m_dispType,
					POSSE_WIDTH*m_nDigitNum,POSSE_HEIGHT,m_nDigitNum);
	}

	//所持数をセットして１桁ずつ抽出させる
	m_Number.SetValue(m_nNumItems);
}
//=============================================================================
//描画
//=============================================================================
void CPossessionNum::Draw()
{
	//数値の描画
	m_Number.Draw();
}
//=============================================================================
//所持数セット
//=============================================================================
void CPossessionNum::SetNum(int num)
{
	m_nNumItems=num;
}
//=============================================================================
//インスタンス生成
//=============================================================================
void CPossessionNum::Create(D3DXVECTOR3 pos,NUMBER_DISP type)
{
	//所持数表示インスタンス生成
	CPossessionNum *pPossessionNum=new CPossessionNum();

	//初期化
	pPossessionNum->Init(pos,type);
}
//EOF