//=============================================================================
//ライフ処理[CLife.cpp]
//Author:HUMITO KIMURA
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "CLife.h"
#include "manager.h"
#include "renderer.h"
#include "CFade.h"
//*****************************************************************************
//定数定義
//*****************************************************************************
#define LIFE_MAX (3)		//ライフ最大値
#define LIFE_SIZE (30.0f)	//ライフ表示サイズ
#define POS_SHIFT (40.0f)	//位置をずらす量
//*****************************************************************************
//スタティックメンバ変数宣言
//*****************************************************************************
int CLife::m_nLife=0;//ライフ数

//=============================================================================
//コンストラクタ
//=============================================================================
CLife::CLife()
{
}
//=============================================================================
//デストラクタ
//=============================================================================
CLife::~CLife()
{
}
//=============================================================================
//初期化
//=============================================================================
HRESULT CLife::Init()
{
	//レンダラー情報取得
	CRenderer *pRenderer=CManager::GetRenderer();

	//頂点バッファ
	LPDIRECT3DDEVICE9 pDevice=pRenderer->GetDevice();

	//ライフの初期化
	m_nLife=LIFE_MAX;

	///////////////////////////
	//	頂点バッファの設定	//
	/////////////////////////

	//頂点バッファの生成
	if(FAILED(pDevice->CreateVertexBuffer
				(sizeof(VERTEX_2D)*4,
				D3DUSAGE_WRITEONLY,
				FVF_VERTEX_2D,
				D3DPOOL_MANAGED,
				&m_pD3DVtxBuff,
				NULL)))
	{
		return E_FAIL;
	}

	//2D頂点情報ポインタ
	VERTEX_2D *pVtx;

	//頂点バッファの設定
	m_pD3DVtxBuff->Lock(0,0,(void**)&pVtx,0);

	//幅
	pVtx[0].rhw=1.0f;
	pVtx[1].rhw=1.0f;
	pVtx[2].rhw=1.0f;
	pVtx[3].rhw=1.0f;
		
	//反射光
	pVtx[0].diffuse=D3DCOLOR_RGBA(255,255,255,255);
	pVtx[1].diffuse=D3DCOLOR_RGBA(255,255,255,255);
	pVtx[2].diffuse=D3DCOLOR_RGBA(255,255,255,255);
	pVtx[3].diffuse=D3DCOLOR_RGBA(255,255,255,255);

	//テクスチャ
	pVtx[0].tex=D3DXVECTOR2(0.0f,1.0f);
	pVtx[1].tex=D3DXVECTOR2(0.0f,0.0f);
	pVtx[2].tex=D3DXVECTOR2(1.0f,1.0f);
	pVtx[3].tex=D3DXVECTOR2(1.0f,0.0f);

	//頂点情報設定終了
	m_pD3DVtxBuff->Unlock();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(	pDevice,
								"data/TEXTURE/Life00.png",
								&m_pD3DTex);

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CLife::Uninit()
{
	//自身の終了
	CScene2D::Uninit();
}
//=============================================================================
//更新
//=============================================================================
void CLife::Update()
{
	///////////////////////////////////
	//		ライフ数チェック		//
	/////////////////////////////////
	//ライフがない場合
	if(m_nLife==0)
	{
		//フェードインでリザルトへ遷移
		CFade::SetFade(FADE_IN,MODE_RESULT);
	}
}
//=============================================================================
//描画
//=============================================================================
void CLife::Draw()
{
	//TODO:後にコメントをはずす
	
	//レンダラーゲット
	CRenderer *pRenderer=CManager::GetRenderer();

	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice=pRenderer->GetDevice();

	//ライフ数分ループ
	for(int i=0;i<m_nLife;i++)
	{
		//頂点情報の変更
		ChangeBuffer(i);

		//頂点バッファのバインド
		pDevice->SetStreamSource(0,m_pD3DVtxBuff,0,sizeof(VERTEX_2D));

		//頂点フォーマットのセット
		pDevice->SetFVF(FVF_VERTEX_2D);

		//テクスチャの設定
		pDevice->SetTexture(0,m_pD3DTex);

		//ポリゴンの描画
		pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP,
								0,//ポリゴンの数
								2);

	}
}
//=============================================================================
//ライフの頂点情報変更
//=============================================================================
void CLife::ChangeBuffer(int num)
{
	//2D頂点情報ポインタ
	VERTEX_2D *pVtx;

	//頂点バッファの設定
	m_pD3DVtxBuff->Lock(0,0,(void**)&pVtx,0);

	//頂点座標
	pVtx[0].vtx=D3DXVECTOR3((POS_SHIFT*num),LIFE_SIZE,0.0f);
	pVtx[1].vtx=D3DXVECTOR3((POS_SHIFT*num),0.0f,0.0f);
	pVtx[2].vtx=D3DXVECTOR3(LIFE_SIZE+(POS_SHIFT*num),LIFE_SIZE,0.0f);
	pVtx[3].vtx=D3DXVECTOR3(LIFE_SIZE+(POS_SHIFT*num),0.0f,0.0f);

	//幅
	pVtx[0].rhw=1.0f;
	pVtx[1].rhw=1.0f;
	pVtx[2].rhw=1.0f;
	pVtx[3].rhw=1.0f;
		
	//反射光
	pVtx[0].diffuse=D3DCOLOR_RGBA(255,255,255,255);
	pVtx[1].diffuse=D3DCOLOR_RGBA(255,255,255,255);
	pVtx[2].diffuse=D3DCOLOR_RGBA(255,255,255,255);
	pVtx[3].diffuse=D3DCOLOR_RGBA(255,255,255,255);

	//テクスチャ
	pVtx[0].tex=D3DXVECTOR2(0.0f,1.0f);
	pVtx[1].tex=D3DXVECTOR2(0.0f,0.0f);
	pVtx[2].tex=D3DXVECTOR2(1.0f,1.0f);
	pVtx[3].tex=D3DXVECTOR2(1.0f,0.0f);

	//頂点情報設定終了
	m_pD3DVtxBuff->Unlock();

}
//=============================================================================
//ライフ減算
//=============================================================================
void CLife::DestLife()
{
	//ライフ減算
	m_nLife--;
}
//=============================================================================
//ライフチェック
//=============================================================================
bool CLife::LostLife()
{
	//ライフが0ならtrueを返す
	if(m_nLife==0)
	{
		return true;
	}

	return false;
}
//=============================================================================
//インスタンス生成
//=============================================================================
void CLife::Create()
{
	//ライフインスタンス生成
	CLife *pLife=new CLife();

	//初期化
	pLife->Init();
}
//EOF