//=============================================================================
// リザルト処理 [CResult.cpp]
// Author : 木村　文登
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "CResult.h"
#include "scene.h"
#include "manager.h"
#include "CResultBg.h"
#include "CResultLogo.h"
#include "CInputKeyboard.h"
#include "CInputJoystick.h"
#include "CScore.h"
#include "CFade.h"
#include "CSound.h"

//=============================================================================
//コンストラクタ
//=============================================================================
CResult::CResult()
{
}
//=============================================================================
//デストラクタ
//=============================================================================
CResult::~CResult()
{
}
//=============================================================================
//初期化
//=============================================================================
HRESULT CResult::Init()
{
	///////////////////////////////////////////////
	//		リザルト関連オブジェクト生成		//
	/////////////////////////////////////////////

	//背景インスタンス生成
	CResultBg::Create();

	//リザルトロゴインスタンス生成
	CResultLogo::Create();

	//スコアインスタンス生成
	CScore::Create(D3DXVECTOR3(270.0f,400.0f,0.0f),400.0f,200.0f,SCORE_RESULT_MODE,DISP_2DPOLYGON,SCORE_DIGIT_MAX);

	//リザルトBGM再生
	CSound::PlaySoundA(SOUND_LABEL_BGM_RESULT);

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CResult::Uninit()
{
	//タイトル関連の全シーンを解放
	CScene::ReleaseAll();
}
//=============================================================================
//更新
//=============================================================================
void CResult::Update()
{
	//シーンオブジェクトの更新
	CScene::UpdateAll();

	//エンターキーが押されたら画面遷移
	if((CInputKeyboard::GetKeyTrigger(DIK_RETURN)	||
		CInputJoystick::GetPadTrigger(BUTTON_START))&&
		CFade::GetFade()==FADE_NONE)
	{
		//ゲームオーバー効果音再生
		CSound::PlaySoundA(SOUND_LABEL_SE_GAMEOVER);

		//タイトルへフェードイン
		CFade::SetFade(FADE_IN,MODE_TITLE);
	}
}
//=============================================================================
//描画
//=============================================================================
void CResult::Draw()
{
}
//EOF