//=============================================================================
//
// シーンクラス処理 [scene.cpp]
// Author : 木村　文登
//
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "renderer.h"
#include "scene.h"

#ifdef _DEBUG
	#include "CDebugproc.h"
#endif
//*****************************************************************************
//スタティックメンバ変数
//*****************************************************************************
CScene *CScene::m_pTop[PRIORITY_MAX]={};//リスト先頭ポインタ
CScene *CScene::m_pCur[PRIORITY_MAX]={};//リスト終端ポインタ
int CScene::m_nNumScene=0;				//総シーン数
//=============================================================================
//コンストラクタ
//=============================================================================
CScene::CScene(int priority)
{
	///////////////////////////////////////
	//	最初のインスタンス限定の処理	//
	/////////////////////////////////////

	//先頭が空なら自身を入れる
	if(m_pTop[priority]==NULL)
	{
		m_pTop[priority]=this;
	}
	//終端が空なら自身を入れる
	if(m_pCur[priority]==NULL)
	{
		m_pCur[priority]=this;
	}

	///////////////////////////////////
	//		インスタンス追加		//
	/////////////////////////////////

	//終端(2番目以降は前に入れたインスタンスとして扱う)の次ポインタに自身を入れる
	m_pCur[priority]->m_pNext=this;

	//終端に自身のポインタがあるなら自身の前ポインタを空にする(最初のインスタンス)
	if(m_pCur[priority]==this)
	{
		m_pPrev=NULL;
	}
	else
	{
		//違う場合自身の前ポインタを終端(前に入れたインスタンス)にする
		m_pPrev=m_pCur[priority];
	}

	//終端を自身のポインタにする
	m_pCur[priority]=this;

	//自身の次ポインタを空にする
	m_pNext=NULL;

	//削除フラグfalse
	m_bDelete=false;

	//総シーンカウントアップ
	m_nNumScene++;
}
//=============================================================================
//デストラクタ
//=============================================================================
CScene::~CScene()
{
}
//=============================================================================
//全インスタンス更新
//=============================================================================
void CScene::UpdateAll()
{

	///////////////////////////////////////////
	//		プライオリティの順番で更新		//
	/////////////////////////////////////////

	//プライオリティ数分ループ
	for(int i=0;i<PRIORITY_MAX;i++)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene=m_pTop[i];

		//シーンポインタがNULLになるまでループ
		while(pScene)
		{
			//シーンの更新
			pScene->Update();
			//次のポインタへ移動
			pScene=pScene->m_pNext;
		}
	}

	//削除フラグのあるインスタンスはリストから削除
	UnLinkList();

//デバッグ時
#ifdef _DEBUG
	CDebug::Print("\nOBJECT Num:%d",m_nNumScene);
#endif
}
//=============================================================================
//全インスタンス描画
//=============================================================================
void CScene::DrawAll()
{
	///////////////////////////////////////////
	//		プライオリティの順番で描画		//
	/////////////////////////////////////////
	for(int i=0;i<PRIORITY_MAX;i++)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene=m_pTop[i];

		//シーンポインタがNULLになるまでループ
		while(pScene)
		{
			//シーンの描画
			pScene->Draw();
			//次のポインタへ移動
			pScene=pScene->m_pNext;
		}
	}

}
//=============================================================================
//全インスタンス解放
//=============================================================================
void CScene::ReleaseAll()
{
	for(int i=0;i<PRIORITY_MAX;i++)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene=m_pTop[i];

		//次ポインタ保存用
		CScene *pNext;

		//シーンポインタがNULLになるまでループ
		while(pScene)
		{
			//解放する前に自身の次ポインタを保存
			pNext=pScene->m_pNext;

			//フェード以外のオブジェクトを終了処理にする
			if(pScene->m_objType!=OBJECT_TYPE_FADE)
			{
				//シーンの終了
				pScene->Uninit();
			}

			//削除フラグtrueのシーンを解放する
			if(pScene->m_bDelete==true)
			{
				//シーンが先頭でかつフェード以外なら
				if(	pScene==m_pTop[i] &&
					pScene->m_objType!=OBJECT_TYPE_FADE)
				{
					//プライオリティ先頭NULLセット
					m_pTop[i]=NULL;
				}

				//シーンが終端でかつフェード以外なら
				if(	pScene==m_pCur[i] &&
					pScene->m_objType!=OBJECT_TYPE_FADE)
				{
					//プライオリティ終端NULLセット
					m_pCur[i]=NULL;
				}

				delete pScene;	//解放
				pScene=NULL;	//NULLセット

				//シーンカウントダウン
				m_nNumScene--;
			}

			//次のポインタへ移動
			pScene=pNext;
		}
	}
}
//=============================================================================
//リストから削除
//=============================================================================
void CScene::UnLinkList()
{
	///////////////////////////////////////////
	//			削除フラグチェック			//
	/////////////////////////////////////////

	//プライオリティの数分ループ
	for(int i=0;i<PRIORITY_MAX;i++)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene=m_pTop[i];

		//シーンがNULLまでループ
		while(pScene)
		{
			//次ポインタを保存
			CScene *pNext=pScene->m_pNext;

			//削除フラグtrueならリンクから削除
			if(pScene->m_bDelete==true)
			{
				///////////////////////////////////////////////
				//		自身の前と次のポインタを繋げる		//
				/////////////////////////////////////////////

				//自身の前ポインタに中身があるなら
				if(pScene->m_pPrev!=NULL)
				{
					//前ポインタの次ポインタを自身の次ポインタにする
					pScene->m_pPrev->m_pNext=pScene->m_pNext;
				}

				//自身の次ポインタに中身があるなら
				if(pScene->m_pNext!=NULL)
				{
					//次ポインタの前ポインタを自身の前ポインタにする
					pScene->m_pNext->m_pPrev=pScene->m_pPrev;
				}

				//自身のポインタが先頭なら
				if(pScene==m_pTop[i])
				{
					//次ポインタを先頭として扱う
					m_pTop[i]=pNext;
				}

				//自身のポインタが終端なら
				if(pScene==m_pCur[i])
				{
					//前ポインタを終端として扱う
					m_pCur[i]=pScene->m_pPrev;
				}

				//自身を解放
				delete pScene;

				//シーンカウントダウン
				m_nNumScene--;
			}

			//次のポインタへ
			pScene=pNext;
		}
	}
}
//=============================================================================
//リスト構造の先頭アドレス取得
//=============================================================================
CScene *CScene::GetListTop(int num)
{
	return m_pTop[num];
}
//=============================================================================
//リストの次ポインタ取得
//=============================================================================
CScene *CScene::GetNextScene(void)
{
	return m_pNext;
}
//=============================================================================
//オブジェクト座標セット
//=============================================================================
void CScene::SetPosition(D3DXVECTOR3 pos)
{
	//引数の座標をセット
	m_pos=pos;
}
//=============================================================================
//シーンの解放
//=============================================================================
void CScene::Release()
{
	m_bDelete=true;
}
//EOF