//=============================================================================
//フェードシェーダー[Fade.hlsl]
//Author:HUMITO KIMURA
//=============================================================================
//****************************************************************
//グローバル変数
//****************************************************************

//フェードを掛ける時間
float g_fFadeTime = 0.0f;

//****************************************************************
//バーテックスシェーダー構造体定義
//****************************************************************
//バーテックスシェーダーからピクセルシェーダーへ渡すための構造体
struct VS_OUTPUT
{
	float4 pos		: POSITION;	//頂点の座標
	float2 tex		: TEXCOORD0;//テクスチャ座標
};

//=============================================================================
//バーテックスシェーダー
//=============================================================================
void VertexShader3D(in float4 pos : POSITION,	//頂点の座標
					in float4 col : COLOR0,		//カラー
					in float2 tex : TEXCOORD0,	//テクスチャ座標
					out VS_OUTPUT outVertex)	//出力用頂点構造体
{
	outVertex.pos = pos;
	outVertex.tex = tex;
}

//=============================================================================
//ピクセルシェーダー
//=============================================================================
void PixelShader3D(out float4 outColor : COLOR0)
{
	outColor = g_fFadeTime;
}
//EOF