//=============================================================================
//弾処理[bullet.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _BULLET_H_
#define _BULLET_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "game.h"
//*****************************************************************************
//定数定義
//*****************************************************************************
#define BULLET_MAX (10)
//*****************************************************************************
//構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3	pos;
	D3DXVECTOR3 rot;
	D3DXVECTOR3 scl;
	float  fMoveX;
	float  fMoveZ;
	float fSize;
	int  nCharge;
	bool  bUse;
	bool  bCurve;
	D3DXMATRIX		mtxWorld;//ワールドマトリックス
}BULLET;
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
HRESULT InitBullet (void);
void UpdateBullet (void);
void DrawBullet (void);
void UninitBullet (void);
void ChargeBullet (void);
void SetPosBullet (float fX,float fZ);
void OutBullet (int i);
BULLET GetBullet (int num);
#endif
//EOF