//=============================================================================
//
// カメラ処理 [camera.h]
// Author : HUMITO KIMURA
//
//=============================================================================
#ifndef _CAMERA_H_
#define _CAMERA_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCamera(void);
void UninitCamera(void);
void UpdateCamera(void);
void SetCamera(void);
D3DXVECTOR3 GetPosCamera (void);
D3DXVECTOR3 GetRotCamera(void);
D3DXMATRIX GetMtxView(void);
#endif
//EOF