#ifndef _EFFECT_H_
#define _EFFECT_H_
//*****************************************************************************
// インクルード
//*****************************************************************************
#include "game.h"
//*****************************************************************************
// 定数定義
//*****************************************************************************
#define MAX_EFFECT (3)
//*****************************************************************************
// 構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3				pos;//ポリゴンの位置
	D3DXVECTOR3				rot;//ポリゴンの向き(回転)
	D3DXVECTOR3				scl;//ポリゴンの大きさ(スケール)
	D3DXMATRIX				mtxWorld;//ワールドマトリックス

}EFFECT;
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEffect (void);
void UpdateEffect(void);
void DrawEffect (void);
void UninitEffect (void);
void SetEffect(D3DXVECTOR3 data,int num,float fMoveX,float fMoveZ,float rot);

#endif
//EOF