//=============================================================================
//天敵処理[enemyA.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _ENEMYA_H_
#define _ENEMYA_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "game.h"
//*****************************************************************************
//定数定義
//*****************************************************************************
#define ENEMYA_MAX (2)
//*****************************************************************************
//構造体定義
//*****************************************************************************
//天敵構造体
typedef struct
{
	D3DXVECTOR3			pos;				//モデルの位置
	D3DXVECTOR3			posMove;			//モデルの移動量
	D3DXVECTOR3			rot;				//モデルの向き
	D3DXVECTOR3			scl;				//モデルの大きさ
	float				fSize;				//モデルのサイズ
	int					nColor;				//色値
	int					nCnt;				//カウント
	int					nHitTime;			//当たり時の経過時間
	bool				bHit;				//ヒットフラグ
	D3DXMATRIX			mtxWorld;			//ワールドマトリックス
}ENEMYA;
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemyA (void);
void UpdateEnemyA (void);
void DrawEnemyA (void);
void UninitEnemyA (void);
ENEMYA GetEnemyA (int num);
void HitEnemyA (int num);
#endif
//EOF