//=============================================================================
//プレイヤー処理[player.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "game.h"
//*****************************************************************************
//マクロ定義
//*****************************************************************************
//*****************************************************************************
//構造体
//*****************************************************************************
//プレイヤーのタイプ
typedef enum
{
	TYPE_NUTRAL=0,	//ニュートラル
	TYPE_MOVE,		//移動A
	TYPE_SHOT,		//ショット(遠距離攻撃)
	TYPE_ATTACK,	//バット(近接攻撃)
	TYPE_MAX		//種類最大値
}TYPE;

//プレイヤー構造体
typedef struct
{
	D3DXVECTOR3			pos;				//モデルの位置
	D3DXVECTOR3			posPre;				//モデルの前位置
	D3DXVECTOR3			posMove;			//モデルの移動量
	D3DXVECTOR3			rot;				//モデルの向き
	D3DXVECTOR3			scl;				//モデルの大きさ
	float				fSize;				//モデルのサイズ
	D3DXVECTOR3			rotDestModel;		//目的の向き
	int					nMovCnt;			//移動時のカウント
	TYPE				type;				//プレイヤーのタイプ
}PLAYER;
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer();		//プレイヤー初期化
void UpdatePlayer();		//プレイヤー更新
void DrawPlayer();			//プレイヤー描画
void UninitPlayer();		//プレイヤー終了
PLAYER GetPlayer();			//プレイヤー情報取得
D3DXVECTOR3 GetPosModel();	//プレイヤー座標取得
D3DXVECTOR3 GetRotModel();	//プレイヤー角度取得
TYPE GetPlayerType();		//プレイヤータイプ取得

#endif
//EOF