//=============================================================================
//壁の処理[wall.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _WALL_H_
#define _WALL_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
//*****************************************************************************
//定数定義
//*****************************************************************************
#define WALL_AHEAD_POS (13900.0f)
#define WALL_BACK_POS (6000.0f)
#define WALL_LEFT_POS (6000.0f)
#define WALL_RIGHT_POS (13900.0f)
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
HRESULT InitWall(float fX,float fY,float fZ,float fRot,int nNumBlockX, int nNumBlockY, float fSizeBlockX, float fSizeBlockY);	//壁の初期化
void UninitWall(void);																											//壁の終了
void UpdateWall(void);																											//壁の更新
void DrawWall(void);																											//壁の描画

#endif _WALL_H_
//EOF