//=============================================================================
//ワイプ処理[wipe.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _WIPE_H_
#define _WIPE_H_
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "main.h"
//*****************************************************************************
//定数定義
//*****************************************************************************
#define MAX_2DBLOCK (25)				//ブロック最大値
#define BLOCK_WIDTH (SCREEN_WIDTH/5)	//ブロックの幅
#define BLOCK_HEIGHT (SCREEN_HEIGHT/5)	//ブロックの高さ
//*****************************************************************************
//構造体
//*****************************************************************************
//列挙型
//ワイプの状態
typedef enum
{
	WIPE_NONE=0,	//ワイプなし
	WIPE_IN,		//ワイプイン
	WIPE_OUT,		//ワイプアウト
	WIPE_MAX		//状態最大値
}WIPE;

//ワイプ構造体
typedef struct
{
	float fX;		//X座標
	float fWidth;	//幅
	float fY;		//Y座標
	float fHeight;	//高さ
	float fDestY;	//目的のY座標
	bool  bSet;		//セットフラグ
}BLOCK;
//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
HRESULT InitWipe (void);	//ワイプ初期化
void UpdateWipe (void);		//ワイプ更新
void DrawWipe (void);		//ワイプ描画
void UninitWipe (void);		//ワイプ終了
WIPE GetWipe(void);			//ワイプ取得
void SetWipe (WIPE type);	//ワイプセット

#endif
//EOF