//=============================================================================
//投影テクスチャシャドウ[ShadowCast.hlsl]
//Author:HUMITO KIMURA
//=============================================================================
//****************************************************************
//グローバル変数
//****************************************************************

//ワールド * ビュー(ライト) * プロジェクション(ライト)
float4x4 g_WorldViewProjection;

//マテリアル色
float4 g_Color;

//****************************************************************
//バーテックスシェーダー構造体定義
//****************************************************************
//バーテックスシェーダーからピクセルシェーダーへ渡すための構造体
struct VS_OUTPUT
{
	float4 pos		: POSITION;	//頂点の座標
	float2 depth	: TEXCOORD0;//深度情報
};

//=============================================================================
//バーテックスシェーダー
//=============================================================================
void VertexShader3D(in float4 pos : POSITION,	//頂点の座標
					in float4 col : COLOR0,		//法線ベクトル
					in float2 tex : TEXCOORD0,	//テクスチャ座標
					out VS_OUTPUT outVertex)	//出力用頂点構造体
{
	outVertex.pos = mul(pos, g_WorldViewProjection);
	outVertex.depth.xy = outVertex.pos.zw;
}
//=============================================================================
//ピクセルシェーダー
//=============================================================================
void PixelShader3D(in VS_OUTPUT inVertex,
					out float4 outColor : COLOR0)
{
	//色情報
	outColor = 0.0f;
	//深度情報
	outColor.a = 1.0f;
}
//EOF