//=============================================================================
//
// ライト管理 [LightManager.h]
// Author : HUMITO KIMURA
//
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "LightManager.h"
#include "Light.h"

//*****************************************************************************
//スタティックメンバ変数宣言
//*****************************************************************************
CLightManager *CLightManager::m_pInstance = NULL;

//=============================================================================
//コンストラクタ
//=============================================================================
CLightManager::CLightManager()
{
	//全てのライト情報NULL
	for (int i = 0; i < LIGHT_NUM; ++i)
	{
		m_pLight[i] = NULL;
	}
}
//=============================================================================
//デストラクタ
//=============================================================================
CLightManager::~CLightManager()
{
	//ライト情報全て初期化
	UninitAll();
}
//=============================================================================
//初期化
//=============================================================================
HRESULT CLightManager::InitAll()
{
	//各ライト情報
	LIGHT_DATA lightData[LIGHT_NUM]=
	{
		//MAIN_LIGHT
		{
			D3DXVECTOR3(-450.0f, -500.0f, -1300.0f),
			D3DLIGHT_DIRECTIONAL
		},
		//SUB_LIGHT1
		{
			D3DXVECTOR3(700.0f, -500.0f, -300.0f),
			D3DLIGHT_DIRECTIONAL
		},
		//SUB_LIGHT2
		{
			D3DXVECTOR3(0.0f, -500.0f, 500.0f),
			D3DLIGHT_DIRECTIONAL
		}
	};

	//ライト情報の生成
	for (int i = 0; i < LIGHT_NUM; ++i)
	{
		m_pLight[i] = new CLight();
		m_pLight[i]->Init(lightData[i].pos,lightData[i].type,(DWORD)i);
	}

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CLightManager::UninitAll()
{
	//全ライト情報解放
	for (int i = 0; i < LIGHT_NUM; ++i)
	{
		if (m_pLight[i])
		{
			delete m_pLight[i];
			m_pLight[i] = NULL;
		}
	}
}
//=============================================================================
//更新
//=============================================================================
void CLightManager::UpdateAll()
{
	//全ライト情報更新
	for (int i = 0; i < LIGHT_NUM; ++i)
	{
		if (m_pLight[i])
		{
			m_pLight[i]->Update();
		}
	}
}
//=============================================================================
//セット
//=============================================================================
void CLightManager::SetAll()
{
	//全ライト情報セット
	for (int i = 0; i < LIGHT_NUM; ++i)
	{
		if (m_pLight[i])
		{
			m_pLight[i]->Set();
		}
	}
}
//EOF