//=============================================================================
//シェーダー管理[ShaderManager.cpp]
//Author:HUMITO KIMURA
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "ShaderManager.h"
#include "ToonShader.h"
#include "Edge.h"
#include "Shader.h"

//*****************************************************************************
//スタティックメンバ変数宣言
//*****************************************************************************
CShader *CShaderManager::m_pShader[SHADER_NUM] = {};	//シェーダー
CShaderManager *CShaderManager::m_pInstance = NULL;		//自身のインスタンス

//=============================================================================
//初期化
//=============================================================================
HRESULT CShaderManager::Init()
{
	//各シェーダーの生成
	for (int i = 0; i < SHADER_NUM; ++i)
	{
		//トゥーンシェーダー
		if (i == TOON_SHADER)
			m_pShader[i] = new CToonShader();

		else if (i == EDGE_FILTER)
			m_pShader[i] = new CEdge();


		if (m_pShader[i])
		{
			//ロードして復元
			m_pShader[i]->Load();
			m_pShader[i]->Restore();
		}
	}

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CShaderManager::Uninit()
{
	//各シェーダーの解放
	for (int i = 0; i < SHADER_NUM; ++i)
	{
		//インスタンスがある場合終了して解放
		if (m_pShader[i])
		{
			m_pShader[i]->Uninit();
			delete m_pShader[i];
			m_pShader[i] = NULL;
		}
	}
}
//EOF