//=============================================================================
// タイトル管理処理 [Title.h]
// Author : 木村 文登
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "State.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CMeshField;

//*****************************************************************************
//クラス定義
//*****************************************************************************
//タイトル管理クラス
class CTitle : public CState
{
	//外部
	public:
		CTitle(){}		//コンストラクタ
		~CTitle(){}		//デストラクタ
		void Init();	//初期化
		void Uninit();	//終了
		void Update();	//更新

		//インスタンス生成
		static CTitle *Create();

		//フィールド取得
		static CMeshField *GetField()
		{ return m_pField; }

	//内部
	private:
		//フィールド取得
		static CMeshField *m_pField;
};
#endif
//EOF