#ifndef _BG_H_
#define _BG_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBgPolygon (void);	//ポリゴン背景の初期化
void DrawBgPolygon (void);		//ポリゴン背景の描画
void UninitBgPolygon (void);	//ポリゴン背景の終了


#endif _BG_H_
//EOF