//=============================================================================
//ソースコード共通で使われる処理[Common.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _COMMON_H_
#define _COMMON_H_

//*****************************************************************************
//マクロ定義
//*****************************************************************************
//オブジェクトの解放
#define RELEASE_OBJECT(p) { if(p){p->Release(); p = NULL;} }

//オブジェクトの削除
#define DELETE_OBJECT(p) { if(p){p->Uninit(); delete p; p = NULL;} }

//NULLチェック
#define IS_NULL(p) { if(p){ return true; } return false;}

#endif
//EOF