//=============================================================================
//デバッグ表示処理[DebugProc.cpp]
//Author:HUMITO KIMURA
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#define _CRT_SECURE_NO_WARNINGS//警告対策用
#include "DebugProc.h"
#include "../manager.h"
#include "../main.h"
#include <stdio.h>

//*****************************************************************************
//静的メンバ変数の宣言
//*****************************************************************************
LPD3DXFONT CDebug::m_pD3DXFont2 = NULL;		//フォントデバイス
char CDebug::m_aStrDebug[1024] = {};		//文字列

//=============================================================================
//コンストラクタ
//=============================================================================
CDebug::CDebug()
{
}
//=============================================================================
//デストラクタ
//=============================================================================
CDebug::~CDebug()
{
}
//=============================================================================
//初期化
//=============================================================================
HRESULT CDebug::Init()
{
	//レンダラー情報取得
	CRenderer *pRenderer = CManager::GetRenderer();

	//デバイスのゲット
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// 情報表示用フォントを設定
	D3DXCreateFont(pDevice, 18, 0, 0, 0, FALSE, SHIFTJIS_CHARSET,
		OUT_DEFAULT_PRECIS, DEFAULT_QUALITY, DEFAULT_PITCH, "Terminal", &m_pD3DXFont2);

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CDebug::Uninit()
{
	//マテリアル情報の終了
	if (m_pD3DXFont2 != NULL)
	{
		m_pD3DXFont2->Release();
		m_pD3DXFont2 = NULL;
	}
}
//=============================================================================
//描画
//=============================================================================
void CDebug::Draw()
{
	RECT rect = { 0, 0, SCREEN_WIDTH, SCREEN_HEIGHT };

	// テキスト描画
	m_pD3DXFont2->DrawText(NULL, m_aStrDebug, -1, &rect, DT_LEFT, D3DCOLOR_ARGB(0xff, 0xff, 0xff, 0xff));

	memset(m_aStrDebug, 0, 1024);
}
//=============================================================================
//出力する文字列
//=============================================================================
void CDebug::Print(char *fmt, ...)
{
	va_list args;		//可変リストへのポインタ
	char *cur;			//文字列のポインタ
	char buf[256] = { 0 };	//結合用文字列
	char work[32];		//バッファ用文字列

	//可変引数開始
	va_start(args, fmt);

	//文字列の代入
	for (cur = fmt; *cur; ++cur)
	{
		//文字列の種類を調べる
		if (*cur != '%')
		{
			//%以外なら１文字を入れる
			sprintf(work, "%c", *cur);
		}
		else
		{
			//それ以外の場合１文字飛ばす
			cur++;

			//%の次のアルファベットによって数値、文字列を入れる
			switch (*cur)
			{
				//整数
			case 'd':
				sprintf(work, "%d", va_arg(args, int));
				break;

				//小数
			case 'f':
				sprintf(work, "%3.3f", va_arg(args, double));
				break;

				//文字
			case 'c':
				sprintf(work, "%c", va_arg(args, char));
				break;

				//文字列
			case 's':
				sprintf(work, "%s", &va_arg(args, char*));
				break;

			default:
				break;
			}
		}

		//文字列を結合する
		strcat(buf, work);
	}
	//可変引数終わり
	va_end(args);

	//文字列にバッファ用の文字列を代入
	strcat(m_aStrDebug, buf);
}
//EOF