//=============================================================================
//
// シーンクラス処理 [scene.cpp]
// Author : 木村　文登
//
//=============================================================================
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "../main.h"
#include "../System/renderer.h"
#include "scene.h"

//*****************************************************************************
//スタティックメンバ変数
//*****************************************************************************
CScene *CScene::m_pTop[PRIORITY_MAX]={};//リスト先頭ポインタ
CScene *CScene::m_pCur[PRIORITY_MAX]={};//リスト終端ポインタ

//=============================================================================
//コンストラクタ
//=============================================================================
CScene::CScene(int priority)
{
	///////////////////////////////////////
	//	最初のインスタンス限定の処理	//
	/////////////////////////////////////

	//先頭が空なら自身を入れる
	if(m_pTop[priority] == NULL)
	{
		m_pTop[priority] = this;
	}
	//終端が空なら自身を入れる
	if(m_pCur[priority] == NULL)
	{
		m_pCur[priority] = this;
	}

	///////////////////////////////////
	//		インスタンス追加		//
	/////////////////////////////////

	//終端(2番目以降は前に入れたインスタンスとして扱う)の次ポインタに自身を入れる
	m_pCur[priority]->m_pNext = this;

	//終端に自身のポインタがあるなら自身の前ポインタを空にする(最初のインスタンス)
	if(m_pCur[priority] == this)
	{
		m_pPrev = NULL;
	}
	else
	{
		//違う場合自身の前ポインタを終端(前に入れたインスタンス)にする
		m_pPrev = m_pCur[priority];
	}

	//終端を自身のポインタにする
	m_pCur[priority] = this;

	//自身の次ポインタを空にする
	m_pNext = NULL;

	//削除フラグfalse
	m_Delete = false;
}
//=============================================================================
//デストラクタ
//=============================================================================
CScene::~CScene()
{
}
//=============================================================================
//全インスタンス更新
//=============================================================================
void CScene::UpdateAll()
{
	for(int i = 0; i < PRIORITY_MAX; ++i)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene = m_pTop[i];

		//シーンポインタがNULLになるまでループ
		while(pScene)
		{
			//シーンの更新
			pScene->Update();
			//次のポインタへ移動
			pScene = pScene->m_pNext;
		}
	}

	///////////////////////////////////////////
	//			削除フラグチェック			//
	/////////////////////////////////////////

	//プライオリティの数分ループ
	for(int i = 0; i < PRIORITY_MAX; ++i)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene = m_pTop[i];

		//シーンがNULLまでループ
		while(pScene)
		{
			//次ポインタを保存
			CScene *pNext = pScene->m_pNext;
			//削除フラグtrueならリストから削除
			if(pScene->m_Delete == true)
			{
				///////////////////////////////////////////////
				//		自身の前と次のポインタを繋げる		//
				/////////////////////////////////////////////

				//自身の前ポインタに中身があるなら
				if(pScene->m_pPrev != NULL)
				{
					//前ポインタの次ポインタを自身の次ポインタにする
					pScene->m_pPrev->m_pNext = pScene->m_pNext;
				}

				//自身の次ポインタに中身があるなら
				if(pScene->m_pNext != NULL)
				{
					//次ポインタの前ポインタを自身の前ポインタにする
					pScene->m_pNext->m_pPrev = pScene->m_pPrev;
				}

				//自身のポインタが先頭なら
				if(pScene == m_pTop[i])
				{
					//次ポインタを先頭として扱う
					m_pTop[i] = pNext;
				}

				//自身のポインタが終端なら
				if(pScene == m_pCur[i])
				{
					//前ポインタを終端として扱う
					m_pCur[i] = pScene->m_pPrev;
				}

				//自身を削除
				delete pScene;
			}

			//次のポインタへ
			pScene = pNext;
		}
	}
}
//=============================================================================
//全インスタンス描画
//=============================================================================
void CScene::DrawAll()
{
	///////////////////////////////////////////
	//		プライオリティの順番で描画		//
	/////////////////////////////////////////
	for(int i = 0; i < PRIORITY_MAX; ++i)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene = m_pTop[i];

		//シーンポインタがNULLになるまでループ
		while(pScene)
		{
			//シーンの描画
			pScene->Draw();
			//次のポインタへ移動
			pScene = pScene->m_pNext;
		}
	}

	///////////////////////////////////////////
	//			削除フラグチェック			//
	/////////////////////////////////////////

	//プライオリティの数分ループ
	for(int i = 0; i < PRIORITY_MAX; ++i)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene = m_pTop[i];

		//シーンがNULLまでループ
		while(pScene)
		{
			//次ポインタを保存
			CScene *pNext = pScene->m_pNext;

			//削除フラグtrueならリンクから削除
			if(pScene->m_Delete == true)
			{
				///////////////////////////////////////////////
				//		自身の前と次のポインタを繋げる		//
				/////////////////////////////////////////////

				//自身の前ポインタに中身があるなら
				if(pScene->m_pPrev != NULL)
				{
					//前ポインタの次ポインタを自身の次ポインタにする
					pScene->m_pPrev->m_pNext = pScene->m_pNext;
				}

				//自身の次ポインタに中身があるなら
				if(pScene->m_pNext != NULL)
				{
					//次ポインタの前ポインタを自身の前ポインタにする
					pScene->m_pNext->m_pPrev = pScene->m_pPrev;
				}

				//自身のポインタが先頭なら
				if(pScene == m_pTop[i])
				{
					//次ポインタを先頭として扱う
					m_pTop[i] = pNext;
				}

				//自身のポインタが終端なら
				if(pScene == m_pCur[i])
				{
					//前ポインタを終端として扱う
					m_pCur[i] = pScene->m_pPrev;
				}

				//自身を解放
				delete pScene;
			}

			//次のポインタへ
			pScene = pNext;
		}
	}
}
//=============================================================================
//全インスタンス解放
//=============================================================================
void CScene::ReleaseAll()
{
	for(int i = 0; i < PRIORITY_MAX; ++i)
	{
		//シーンに先頭ポインタを入れる
		CScene *pScene = m_pTop[i];

		//次ポインタ保存用
		CScene *pNext;

		//シーンポインタがNULLになるまでループ
		while(pScene)
		{
			//解放する前に自身の次ポインタを保存
			pNext = pScene->m_pNext;

			//シーンの終了
			pScene->Uninit();

			if(pScene->m_Delete == true)
			{
				//解放
				delete pScene;
				pScene = NULL;
				m_pTop[i] = NULL;
			}

			//次のポインタへ移動
			pScene = pNext;
		}

		m_pCur[i] = NULL;
	}
}
//=============================================================================
//シーンの解放
//=============================================================================
void CScene::Release()
{
	m_Delete = true;
}
//EOF