//=============================================================================
//プレイヤー処理[Player.h]
//Author:HUMITO KIMURA
//=============================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "../Scene/SceneX.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CShader;

//*****************************************************************************
//クラス定義
//*****************************************************************************
//プレイヤークラス
class CPlayer : public CSceneX
{
	//外部
	public:
		CPlayer();									//コンストラクタ
		~CPlayer(){}								//デストラクタ

		//初期化
		HRESULT Init(D3DXVECTOR3 pos,
					D3DXVECTOR3 rot);

		void Uninit();								//終了
		void Update();								//更新
		void Draw();								//描画

		//インスタンス生成
		static CPlayer *Create(D3DXVECTOR3 pos,
								D3DXVECTOR3 rot);

	//内部
	private:
		CShader		*m_pUseShader;	//使用するシェーダー
		D3DXVECTOR3	m_velocity;		//プレイヤー移動量
		D3DXMATRIX	m_mtxWorldOld;	//前フレームのワールドマトリックス
		float		m_fDestRotY;	//目的の角度

		//モデルの移動
		void MoveModel();

		//モデルの当たり判定
		void HitCheck();
};
#endif
//EOF