//=============================================================================
// タイム処理 [Time.cpp]
// Author : HUMITO KIMURA
//=============================================================================
//*****************************************************************************
//インクルードファイル
//*****************************************************************************
#include "Time.h"
#include "../main.h"
#include "../manager.h"
#include "../System/renderer.h"
#include "../Object/Image.h"
#include "../Shader/Fade.h"

//*****************************************************************************
//定数定義
//*****************************************************************************
#define TIME_TEXTURE_FILENAME ("data/TEXTURE/number001.png")//タイムのテクスチャファイル名
#define TIME_NUM_MAX (99.0f)								//タイム最大値
#define START_TIME_NUM (31.0f)								//開始タイム

//*****************************************************************************
//スタティックメンバ変数
//*****************************************************************************
float CTime::m_fTime = 0.0f;	//タイムの値

//=============================================================================
//初期化
//=============================================================================
HRESULT CTime::Init(D3DXVECTOR3 pos, float fWidth, float fHeight,
					int mode, NUMBER_DISP type, int nDigitNum)
{
	//数値の設定
	m_fTime = START_TIME_NUM;

	//タイムアップフラグ
	m_bTimeUp = false;

	//数値表示インスタンス初期化
	m_Number.Init(TIME_TEXTURE_FILENAME, pos, type,
				fWidth, fHeight, nDigitNum);

	return S_OK;
}
//=============================================================================
//終了
//=============================================================================
void CTime::Uninit()
{
	//数値の終了
	m_Number.Uninit();

	//自身の終了
	CScene2D::Uninit();
}
//=============================================================================
//更新
//=============================================================================
void CTime::Update()
{
	if (m_fTime < 0.0f)
	{
		//タイムフラグfalseなら
		if (!m_bTimeUp)
		{
			//タイムアップフラグtrue
			m_bTimeUp = true;

			//メッセージ画像の生成
			D3DXVECTOR3 pos = D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2.0f, 0.0f);
			CImage::Create("data/TEXTURE/win_message.png", pos,
							SCREEN_WIDTH / 2.0f, SCREEN_HEIGHT / 2.0f);

			//リザルトへフェードイン
			CFade::StartFade(RESULT_STATE);
		}
	}
	else
	{
		//最大値以上にさせない
		if (m_fTime > TIME_NUM_MAX)
		{
			m_fTime = TIME_NUM_MAX;
		}

		//タイム減算
		m_fTime -= 0.01f;

		//数値のセット
		m_Number.SetValue((int)m_fTime);
	}
}
//=============================================================================
//描画
//=============================================================================
void CTime::Draw()
{
	//数値の表示
	m_Number.Draw();
}
//=============================================================================
//タイム加算
//=============================================================================
void CTime::AddTime(float fTime)
{
	m_fTime += fTime;
}
//=============================================================================
//インスタンス生成
//=============================================================================
void CTime::Create(D3DXVECTOR3 pos, float fWidth, float fHeight,
	int mode, NUMBER_DISP type, int nDigitNum)
{
	//インスタンス生成して初期化
	CTime *pTime = new CTime();
	pTime->Init(pos, fWidth, fHeight, mode, type, nDigitNum);
}
//EOF